Autodesk.Revit.DB.Architecture.Stairs.IsByComponent(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Indicates if the stairs is created by stairs components(runs, landings and supports).
document:
The document.
stairsId:
The stairs element to check.
Returns:
True if the stairs is created by components, False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element stairsId does not exist in the document
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013